package 古典生兔题;

/**
 * 一对兔子，从出生后第3个月起每个月都生一对兔子，小兔子长到第三个月后每个月又生一
 * 对兔子，假如兔子都不死，问第35个月的兔子总数为多少？
 * 关于这题的解法：
 * 其中总共兔子对数为1,1,2,3,5,8,13，
 * 其中老兔子的对数为0,0,1,1,2,3,5,8，
 * 可以看出是两个相邻数的相加，为斐波那契数列。
 */

public class solution {
    public static void main(String[] args) {
        long[] a = new long[38];
        for (int i = 0; i <= 35; i++) {
            if (i == 0) {
                a[i] = 1;
                a[i + 1] = 1;
            }
            a[i + 2] = a[i] + a[i + 1];
            System.out.println("第" + (i + 1) + "个月有兔子" + (a[i] * 2) + "只");
        }
    }
}

